app/views/groups/index.html.erb

        <td><%= group.owner.name %></td>
        <td><%= group.users.count %></td>
---
SELECT COUNT(*) FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ?  [["group_id", 1]]

          <% else %>
            <%= link_to 'Join this group', join_group_path(group), method: :post, class: 'btn btn-primary' unless current_user.joined_groups.include?(group) %>
---
SELECT "groups".* FROM "groups"