app/views/groups/show.html.erb

<p>Owner: <%= @group.owner.name %></p>
<p>Members: <%= @group.users.count %></p>
---
SELECT "users".* FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ?  [["group_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ?  [["group_id", 1]]

<ul>
  <% @group.users.each do |member| %>
---
SELECT "users".* FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ?  [["group_id", 1]]