app/views/users/show.html.erb

                  <div>
                    <% if current_user.favorites.exists?(book_id: book.id) %>
                      <%= link_to 'いいねを外す', book_favorite_path(book, current_user.favorites.find_by(book_id: book.id)), method: :delete %>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 4], ["book_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 4], ["book_id", 1], ["LIMIT", 1]]

                    <% end %>
                    <span><%= book.favorites.count %></span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]


                  <% book.book_comments.each do |comment| %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]