app/views/books/index.html.erb

SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
---
        <td>
          <% if current_user.favorites.exists?(book_id: book.id) %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
          <% end %>
          <span><%= book.favorites.count %></span>