app/views/books/top_liked.html.erb

    <p><%= book.body %></p>
    <p>Liked by <%= book.favorites.count %> people</p>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]