app/controllers/books_controller.rb

  def show
    @user = @book.user
    @book.increment_views_count
---
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "hage"], ["updated_at", "2024-05-16 02:20:17.982779"], ["id", 1]]

  def create
    @book = current_user.books.build(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "views_count") VALUES (?, ?, ?, ?, ?, ?)  [["title", "お兄"], ["body", "遊ぶ"], ["user_id", 1], ["created_at", "2024-06-07 06:51:59.970028"], ["updated_at", "2024-06-07 06:51:59.970028"], ["views_count", 0]]

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "hage"], ["updated_at", "2024-05-16 02:20:17.982779"], ["id", 1]]

  def top_liked
    @books = Book.joins(:favorites)
                 .where(favorites: { created_at: 1.week.ago..Time.current })
                 .group('books.id')
                 .order('COUNT(favorites.id) DESC')
---
SELECT "books".* FROM "books" INNER JOIN "favorites" ON "favorites"."book_id" = "books"."id" WHERE "favorites"."created_at" BETWEEN ? AND ? GROUP BY "books"."id" ORDER BY COUNT(favorites.id) DESC  [["created_at", "2024-05-29 08:28:43.623220"], ["created_at", "2024-06-05 08:28:43.623482"]]