app/controllers/books_controller.rb

  def show
    @user = @book.user
    @average_rating = @book.ratings.average(:value).to_f.round(2)
---
SELECT AVG("ratings"."value") FROM "ratings" WHERE "ratings"."book_id" = ?  [["book_id", 2]]

  def create
    @book = current_user.books.build(book_params)
    if @book.save
      if params[:book][:rating].present?
---
SELECT "books".* FROM "books"