app/controllers/events_controller.rb

  def set_group
    @group = Group.find(params[:group_id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]