app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    @group.owner = current_user
    if @group.save
---
INSERT INTO "groups" ("name", "description", "created_at", "updated_at", "owner_id") VALUES (?, ?, ?, ?, ?)  [["name", "チワワ"], ["description", "dogs"], ["created_at", "2024-06-08 04:50:25.701542"], ["updated_at", "2024-06-08 04:50:25.701542"], ["owner_id", 1]]