app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "introduction" = ? WHERE "users"."id" = ?  [["updated_at", "2024-06-02 00:36:21.756362"], ["introduction", ""], ["id", 4]]