app/models/book.rb

UPDATE "books" SET "views_count" = COALESCE("views_count", 0) + ? WHERE "books"."id" = ?  [["views_count", 1], ["id", 1]]
---
  def increment_views_count
    self.increment!(:views_count)